Ran Plan for project: `production-environment` dir: `resume-qliu-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.rg-qliubackend-prod.azurerm_cosmosdb_account.cosmos-qliubackend-prod will be created
+ resource "azurerm_cosmosdb_account" "cosmos-qliubackend-prod" {
+       access_key_metadata_writes_enabled           = true
+       analytical_storage_enabled                   = false
+       automatic_failover_enabled                   = false
+       burst_capacity_enabled                       = false
+       create_mode                                  = (known after apply)
+       default_identity_type                        = "FirstPartyIdentity"
+       endpoint                                     = (known after apply)
+       free_tier_enabled                            = false
+       id                                           = (known after apply)
+       is_virtual_network_filter_enabled            = false
+       kind                                         = "GlobalDocumentDB"
+       local_authentication_disabled                = false
+       location                                     = "westus2"
+       minimal_tls_version                          = "Tls12"
+       mongo_server_version                         = (known after apply)
+       multiple_write_locations_enabled             = false
+       name                                         = "cosmos-qliubackend-prod"
+       network_acl_bypass_for_azure_services        = false
+       offer_type                                   = "Standard"
+       partition_merge_enabled                      = false
+       primary_key                                  = (sensitive value)
+       primary_mongodb_connection_string            = (sensitive value)
+       primary_readonly_key                         = (sensitive value)
+       primary_readonly_mongodb_connection_string   = (sensitive value)
+       primary_readonly_sql_connection_string       = (sensitive value)
+       primary_sql_connection_string                = (sensitive value)
+       public_network_access_enabled                = true
+       read_endpoints                               = (known after apply)
+       resource_group_name                          = "rg-qliubackend-prod"
+       secondary_key                                = (sensitive value)
+       secondary_mongodb_connection_string          = (sensitive value)
+       secondary_readonly_key                       = (sensitive value)
+       secondary_readonly_mongodb_connection_string = (sensitive value)
+       secondary_readonly_sql_connection_string     = (sensitive value)
+       secondary_sql_connection_string              = (sensitive value)
+       write_endpoints                              = (known after apply)

+       analytical_storage (known after apply)

+       backup (known after apply)

+       capabilities (known after apply)

+       capacity (known after apply)

+       consistency_policy {
+           consistency_level = "Strong"
        }

+       geo_location {
+           failover_priority = 0
+           id                = (known after apply)
+           location          = "westus2"
+           zone_redundant    = false
        }
    }

  # module.rg-qliubackend-prod.azurerm_cosmosdb_sql_container.cosmos-sql-container-prod will be created
+ resource "azurerm_cosmosdb_sql_container" "cosmos-sql-container-prod" {
+       account_name          = "cosmos-qliubackend-prod"
+       database_name         = "cosmos-sql-db-prod"
+       id                    = (known after apply)
+       name                  = "cosmos-sql-container-prod"
+       partition_key_kind    = "Hash"
+       partition_key_paths   = [
+           "/id",
        ]
+       partition_key_version = 1
+       resource_group_name   = "rg-qliubackend-prod"
+       throughput            = 400

+       conflict_resolution_policy (known after apply)

+       indexing_policy (known after apply)
    }

  # module.rg-qliubackend-prod.azurerm_cosmosdb_sql_database.cosmos-sql-db-prod will be created
+ resource "azurerm_cosmosdb_sql_database" "cosmos-sql-db-prod" {
+       account_name        = "cosmos-qliubackend-prod"
+       id                  = (known after apply)
+       name                = "cosmos-sql-db-prod"
+       resource_group_name = "rg-qliubackend-prod"
+       throughput          = 400
    }

  # module.rg-qliubackend-prod.azurerm_resource_group.rg-qliubackend-prod will be created
+ resource "azurerm_resource_group" "rg-qliubackend-prod" {
+       id       = (known after apply)
+       location = "westus2"
+       name     = "rg-qliubackend-prod"
+       tags     = {
+           "Description" = "Resource group for storing backend data for resume.qliu.ca"
+           "Environment" = "Development"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production-environment
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://957e114ea4dd:4141/lock?id=qingfengliu0%252FAzureIaC%252Fresume-qliu-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production-environment
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```